README.org
#+TITLE: Configuração do Emacs
#+AUTHOR: Guaracy Monteiro
#+EMAIL: guaracy.bm@gmail.com

#+SETUPFILE: readtheorg-html.setup

#+STARTUP: showeverything
#+STARTUP: indent

* Introdução

O objetivo principal deste documento é demonstrar um pouco de [[http://howardism.org/Technical/Emacs/literate-programming-tutorial.html][Literate Programming]] utilizando o Emacs juntamente com o org-mode. Ao término será possível gerar a documentação e o fonte do arquivo de configuração *eu* que estou utilizando no momento para o Emacs.

Esta configuração não é específica para os usuários do [[http://www.vim.org/][Vim]] (pelo menos para os que querem algo mais semelhante). Se você é um feliz usuário do Vim e deseja aprender [[https://www.gnu.org/software/emacs/][Emacs]] para usar suas facilidades como o [[http://orgmode.org/][org-mode]], etc., você deverá visitar o [[https://github.com/syl20bnr/spacemacs][Spacemacs]], [[https://github.com/hzenginx/spacelite][Spacelite]], [[https://github.com/hlissner/.emacs.d][Doom]] e outros. Eles configuram o Emacs de forma que você se sinta mais a vontade com relação aos atalhos do Vim e/ou visualmente.

Só no [[https://melpa.org/][Melpa]], existem mais de 3.600 pacotes para você configurar seu Emacs de modo a ficar mais adequado para o que você vai fazer. O arquivo gerado por este documento pode servir de base. Partir do zero pode ser complicado. Pode ser melhor você procurar na internet o que ou como os usuários configuraram o ambiente para uma determinada finalidade. Se você trabalha com Ruby, pode verificar como [[http://crypt.codemancers.com/posts/2013-09-26-setting-up-emacs-as-development-environment-on-osx/][este]] usuário configurou o ambiente dele. Ou uma configuração mais específica para [[https://stackoverflow.com/questions/7543428/configure-emacs-for-web-development-php#7543666][PHP]] ou para [[https://www.emacswiki.org/emacs/PythonProgrammingInEmacs][Python]], [[http://alchemist.readthedocs.io/en/latest/configuration/][Elixir]], [[https://wiki.haskell.org/Emacs][Haskell]], etc.. É a melhor configuração para ele mas já é um bom começo. No site da [[http://sachachua.com/blog/category/geek/emacs/][Sacha]] sempre tem as novidades da semana que incluem pacotes, dicas, etc.. Comece com alguma configuração existente, procure por outras e vá adaptando para o seu gosto pessoal.

Se você deseja utilizar esta configuração como base, leia normalmente este texto para ver a estrutura de cada etapa. O tópico de [[adaptacao][Adaptações]] pode auxiliá-lo sobre o que tirar, deixar e alterar.

* Configuração do Emacs

A ordem dos arquivos onde o Emacs busca pelas configurações é:
- ~/emacs
- ~/emacs.el
- ~/.emacs.d/init.el

Os arquivos são em [[https://www.gnu.org/software/emacs/manual/html_node/elisp/][Emacs Lisp]] ou elisp, um dialeto de Lisp. Não é o objetivo ensinar a linguagem, mas é bem simples. Basicamente (função argumentos ...). Por exemplo, em (* 1 2 3 4 5), a função multiplicação recebe os argumentos 1 2 3 4 e 5. Nem é preciso dizer que o resultado será 120. Os parênteses são utilizados para definir a prioridade.

* Geração dos arquivos

** Configuração (.emacs)

Para a geração da configuração é necessário abrir este arquivo com o Emacs (uma instalação nova já seria o suficiente) e digitar =C-c C-v t=. Significa pressionar =Control+c=, =Control+v= e a tecla =t=. Todos os códigos desejados serão gravados no arquivo *~/.emacs*. Para que a nova configuração tenha efeito, o modo mais simples é sair do Emacs (=C-x C-c=) e iniciá-lo novamente.

#+BEGIN_danger
Será gerado o arquivo *~/.emacs*. Caso você já tenha este o arquivo já exista na pasta do seu usuário, faça uma cópia antes pois o conteúdo anterior será perdido.
#+END_danger

** Documentação (README.html)

Para a geração do arquivo de configuração, basta pressionar =C-e h h=. Para uma apresentação melhor dos documentos é necessário uma formatação adequada. A formatação utilizada aqui é a ReadTheOrg encontrada em [[https://github.com/fniessen/org-html-themes][org-html-themes]]. 

** README para o GitHub

Não é necessário a geração. O GitHub entende (não totalmente) o formato .org. Este é o motivo de gerar a documentação como README.html. Nada impediria que você trocar o nome do arquivo. Por praticidade, deixei assim.

* Estrutura do arquivo .emacs
  :PROPERTIES:
  :header-args:   :tangle ~/.emacs
  :END:

