README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<!-- 2017-08-22 ter 11:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Configuração do Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Guaracy Monteiro" />
<link rel="stylesheet" type="text/css" href="assets/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="assets/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Configuração do Emacs</h1>
<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org986cfea">1. Introdução</a></li>
<li><a href="#orgb8a0eee">2. Configuração do Emacs</a></li>
<li><a href="#org6e763dc">3. Geração dos arquivos</a>
<ul>
<li><a href="#org21a6d4b">3.1. Configuração (.emacs)</a></li>
<li><a href="#orgc91ed62">3.2. Documentação (README.html)</a></li>
<li><a href="#org9b8d189">3.3. README para o GitHub</a></li>
</ul>
</li>
<li><a href="#org004b231">4. Estrutura do arquivo .emacs</a>
<ul>
<li><a href="#orgafa97aa">4.1. Aspecto visual</a></li>
<li><a href="#org712c39e">4.2. Repositórios</a></li>
<li><a href="#orgf1fc2d6">4.3. Instalação dos pacotes</a>
<ul>
<li><a href="#org3d038c8">4.3.1. org-ioslide</a></li>
</ul>
</li>
<li><a href="#org26dd20e">4.4. Configurações para auxiliar a digitação</a>
<ul>
<li><a href="#orgf6d1f43">4.4.1. which-key</a></li>
<li><a href="#orgfceabc4">4.4.2. smex</a></li>
<li><a href="#org71b00c3">4.4.3. iedit</a></li>
<li><a href="#org684db8f">4.4.4. multiple-cursors</a></li>
<li><a href="#org65ea95b">4.4.5. ido-yes-or-no</a></li>
<li><a href="#org37db787">4.4.6. auto-complete</a></li>
</ul>
</li>
<li><a href="#org75161c4">4.5. Configurações visuais</a>
<ul>
<li><a href="#orge35b911">4.5.1. zerodark-theme</a></li>
<li><a href="#orgf1f3b66">4.5.2. ido-grid-mode</a></li>
<li><a href="#orgfe8c077">4.5.3. ido-select-window</a></li>
<li><a href="#org7d737e9">4.5.4. hlinum-mode</a></li>
<li><a href="#orgf8148dc">4.5.5. linum-off</a></li>
<li><a href="#org7423fc3">4.5.6. indent-guide</a></li>
<li><a href="#org1ade761">4.5.7. rainbow-delimiters </a></li>
</ul>
</li>
<li><a href="#org87b2edf">4.6. Utilitários</a>
<ul>
<li><a href="#org8c115b0">4.6.1. restart-emacs</a></li>
<li><a href="#orgd1f894c">4.6.2. htmlize</a></li>
<li><a href="#org7d33a7b">4.6.3. neotree</a></li>
<li><a href="#org5078264">4.6.4. paradox</a></li>
<li><a href="#org94b1df9">4.6.5. magit</a></li>
<li><a href="#orgaee22c6">4.6.6. el2org e ox-gfm</a></li>
<li><a href="#org36687d2">4.6.7. org-webpage </a></li>
</ul>
</li>
<li><a href="#org240ce35">4.7. Linguagens</a>
<ul>
<li><a href="#org011991c">4.7.1. red.el </a></li>
<li><a href="#orge870212">4.7.2. less-css-mode</a></li>
</ul>
</li>
<li><a href="#orgab961dd">4.8. Configurações adicionais</a></li>
<li><a href="#org252ed75">4.9. Definição de funções</a>
<ul>
<li><a href="#org73838cf">4.9.1. Abrir lista de arquivos recente (C-x C-r))</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb5e7801">5. Adaptações </a>
<ul>
<li><a href="#orgfe8da0b">5.1. Requisitos</a></li>
<li><a href="#org4fc4155">5.2. Iniciando</a></li>
<li><a href="#org9456280">5.3. Alterando</a></li>
<li><a href="#org8d2599c">5.4. Gerando</a></li>
</ul>
</li>
<li><a href="#orgea5c59e">6. Problemas</a></li>
</ul>
</div>
</div>

<div id="outline-container-org986cfea" class="outline-2">
<h2 id="org986cfea"><span class="section-number-2">1</span> Introdução</h2>
<div class="outline-text-2" id="text-1">
<p>
O objetivo principal deste documento é demonstrar um pouco de <a href="http://howardism.org/Technical/Emacs/literate-programming-tutorial.html">Literate Programming</a> utilizando o Emacs juntamente com o org-mode. Ao término será possível gerar a documentação e o fonte do arquivo de configuração <b>eu</b> que estou utilizando no momento para o Emacs.
</p>

<p>
Esta configuração não é específica para os usuários do <a href="http://www.vim.org/">Vim</a> (pelo menos para os que querem algo mais semelhante). Se você é um feliz usuário do Vim e deseja aprender <a href="https://www.gnu.org/software/emacs/">Emacs</a> para usar suas facilidades como o <a href="http://orgmode.org/">org-mode</a>, etc., você deverá visitar o <a href="https://github.com/syl20bnr/spacemacs">Spacemacs</a>, <a href="https://github.com/hzenginx/spacelite">Spacelite</a>, <a href="https://github.com/hlissner/.emacs.d">Doom</a> e outros. Eles configuram o Emacs de forma que você se sinta mais a vontade com relação aos atalhos do Vim e/ou visualmente.
</p>

<p>
Só no <a href="https://melpa.org/">Melpa</a>, existem mais de 3.600 pacotes para você configurar seu Emacs de modo a ficar mais adequado para o que você vai fazer. O arquivo gerado por este documento pode servir de base. Partir do zero pode ser complicado. Pode ser melhor você procurar na internet o que ou como os usuários configuraram o ambiente para uma determinada finalidade. Se você trabalha com Ruby, pode verificar como <a href="http://crypt.codemancers.com/posts/2013-09-26-setting-up-emacs-as-development-environment-on-osx/">este</a> usuário configurou o ambiente dele. Ou uma configuração mais específica para <a href="https://stackoverflow.com/questions/7543428/configure-emacs-for-web-development-php#7543666">PHP</a> ou para <a href="https://www.emacswiki.org/emacs/PythonProgrammingInEmacs">Python</a>, <a href="http://alchemist.readthedocs.io/en/latest/configuration/">Elixir</a>, <a href="https://wiki.haskell.org/Emacs">Haskell</a>, etc.. É a melhor configuração para ele mas já é um bom começo. No site da <a href="http://sachachua.com/blog/category/geek/emacs/">Sacha</a> sempre tem as novidades da semana que incluem pacotes, dicas, etc.. Comece com alguma configuração existente, procure por outras e vá adaptando para o seu gosto pessoal.
</p>

<p>
Se você deseja utilizar esta configuração como base, leia normalmente este texto para ver a estrutura de cada etapa. O tópico de <a href="#orga22f394">Adaptações</a> pode auxiliá-lo sobre o que tirar, deixar e alterar.
</p>
</div>
</div>

<div id="outline-container-orgb8a0eee" class="outline-2">
<h2 id="orgb8a0eee"><span class="section-number-2">2</span> Configuração do Emacs</h2>
<div class="outline-text-2" id="text-2">
<p>
A ordem dos arquivos onde o Emacs busca pelas configurações é:
</p>
<ul class="org-ul">
<li>~/emacs</li>
<li>~/emacs.el</li>
<li>~/.emacs.d/init.el</li>
</ul>

<p>
Os arquivos são em <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/">Emacs Lisp</a> ou elisp, um dialeto de Lisp. Não é o objetivo ensinar a linguagem, mas é bem simples. Basicamente (função argumentos &#x2026;). Por exemplo, em (* 1 2 3 4 5), a função multiplicação recebe os argumentos 1 2 3 4 e 5. Nem é preciso dizer que o resultado será 120. Os parênteses são utilizados para definir a prioridade.
</p>
</div>
</div>

<div id="outline-container-org6e763dc" class="outline-2">
<h2 id="org6e763dc"><span class="section-number-2">3</span> Geração dos arquivos</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org21a6d4b" class="outline-3">
<h3 id="org21a6d4b"><span class="section-number-3">3.1</span> Configuração (.emacs)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Para a geração da configuração é necessário abrir este arquivo com o Emacs (uma instalação nova já seria o suficiente) e digitar <code>C-c C-v t</code>. Significa pressionar <code>Control+c</code>, <code>Control+v</code> e a tecla <code>t</code>. Todos os códigos desejados serão gravados no arquivo <b>~/.emacs</b>. Para que a nova configuração tenha efeito, o modo mais simples é sair do Emacs (<code>C-x C-c</code>) e iniciá-lo novamente.
</p>

<div class="danger">
<p>
Será gerado o arquivo <b>~/.emacs</b>. Caso você já tenha este o arquivo já exista na pasta do seu usuário, faça uma cópia antes pois o conteúdo anterior será perdido.
</p>

</div>
</div>
</div>

<div id="outline-container-orgc91ed62" class="outline-3">
<h3 id="orgc91ed62"><span class="section-number-3">3.2</span> Documentação (README.html)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Para a geração do arquivo de configuração, basta pressionar <code>C-e h h</code>. Para uma apresentação melhor dos documentos é necessário uma formatação adequada. A formatação utilizada aqui é a ReadTheOrg encontrada em <a href="https://github.com/fniessen/org-html-themes">org-html-themes</a>. 
</p>
</div>
</div>

<div id="outline-container-org9b8d189" class="outline-3">
<h3 id="org9b8d189"><span class="section-number-3">3.3</span> README para o GitHub</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Não é necessário a geração. O GitHub entende (não totalmente) o formato .org. Este é o motivo de gerar a documentação como README.html. Nada impediria que você trocar o nome do arquivo. Por praticidade, deixei assim.
</p>
</div>
</div>
</div>

<div id="outline-container-org004b231" class="outline-2">
<h2 id="org004b231"><span class="section-number-2">4</span> Estrutura do arquivo .emacs</h2>
<div class="outline-text-2" id="text-4">
</div>
