README.org
***  [[https://github.com/nonsequitur/smex][smex]]

Facilita a execução de comandos quando o usuário digita =Alt-x= (comandos gerais) ou =Alt-X= (comandos do modo atual do buffer).

#+BEGIN_SRC emacs-lisp +n
  (use-package smex
    :ensure t
    :bind (("M-x" . smex)
           ("M-X" . smex-major-mode-commands)))
#+END_SRC

*** [[https://github.com/victorhge/iedit][iedit]]

Parecido com [[https://github.com/magnars/multiple-cursors.el][multiple-cursors]], permite a edição simultânea de multiplas regiões. Pessoalmente, acho interessante o fato de =C-'= esconder o resto do texto para uma vizualização geral das ocorrências, editar apenas as ocorrências de uma função ou linha.

#+BEGIN_SRC emacs-lisp +n
  (use-package iedit
    :ensure t
    :bind (("C-;" . iedit-mode)
           ("C-RET" . iedit-rectangle-mode)))
#+END_SRC

#+begin_tip 
- =C-;= com o cursor em uma palavra para selecionar todas do texto. Pressione novamente para sair
- =C-'= esconde o texto deixando apenas uma linha antes e depois para visualização mais global
- =M-{= expande uma linha para cima
- =M-}= expande uma linha para baixo
- =M-;= altera a seleção
- =M-I= apenas a linha corrente
- =M-SPC= troca as seleções por espaços
- =M-<= primeira ocorrência
- =M->= última ocorrência
- =M-D= exclui todas ocorrências
- =M-L= converte para minúsculas
- =M-U= converte para maiúsculas
- =M-R= troca ocorrências por ...
- =M-N= númera de ocorrências
- etc..
#+end_tip

*** [[https://github.com/magnars/multiple-cursors.el][multiple-cursors]]

Trabalha com multiplos cursores. Parecido com iedit anterior mas tem algumas vantagens como os cursores mais flexíveis. Na página tem mais informações. Este [[http://emacsrocks.com/e13.html][vídeo]] tem um exemplo muito interessante para a utilização. Existem diversos vídeos no site cobrindo outros assuntos.

#+BEGIN_SRC emacs-lisp +n
  (use-package multiple-cursors
    :ensure t
    :bind (("C-S-c C-S-c" . mc/edit-lines)
           ("C->" . mc/mark-next-like-this)
           ("C-<" . mc/mark-previous-like-this)))
#+END_SRC

***  [[https://github.com/DarwinAwardWinner/ido-yes-or-no][ido-yes-or-no]]

Facilita respostas com yes/no permitindo apenas o pressionamento de y/n e enter.

#+BEGIN_SRC emacs-lisp +n
  (use-package ido-yes-or-no
    :ensure t
    :config
    (ido-yes-or-no-mode t))
#+END_SRC

*** [[https://github.com/auto-complete/auto-complete][auto-complete]]

Mostra um menu para auxiliar a completar o que está sendo digitado.

#+BEGIN_SRC emacs-lisp +n
  (use-package auto-complete
    :ensure t
    :config
    (ac-config-default))
#+END_SRC

** Configurações visuais

*** [[https://github.com/NicolasPetton/zerodark-theme][zerodark-theme]]

Achei o thema interessante. Você pode ir em [[https://emacsthemes.com/][Emacs Themes]] e ver outros que você pode gostar mais.

#+BEGIN_SRC emacs-lisp +n
  (use-package zerodark-theme
    :ensure t
    :config
    (load-theme 'zerodark t))
#+END_SRC

*** [[https://github.com/larkery/ido-grid-mode.el][ido-grid-mode]]

Apenas para combinar mais com a apresentação do which-key. Mostra as opções em grade em vez de linha.

#+BEGIN_SRC emacs-lisp +n
  (use-package ido-grid-mode
    :ensure t
    :config
    (setq ido-enable-flex-matching t)
    (setq ido-everywhere t)
    (ido-mode t)
    (ido-grid-mode t))
#+END_SRC

*** [[https://github.com/pjones/ido-select-window][ido-select-window]]

Facilita a seleção da janela quando existem diversos buffers visualizados simultaneamente.

#+BEGIN_SRC emacs-lisp +n
  (use-package ido-select-window
    :ensure t
    :bind ("C-x o" . ido-select-window))
#+END_SRC

