README.html

<div id="outline-container-orgfceabc4" class="outline-4">
<h4 id="orgfceabc4"><span class="section-number-4">4.4.2</span> <a href="https://github.com/nonsequitur/smex">smex</a></h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
Facilita a execução de comandos quando o usuário digita <code>Alt-x</code> (comandos gerais) ou <code>Alt-X</code> (comandos do modo atual do buffer).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">48: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">smex</span>
<span class="linenr">49: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">50: </span>  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"M-x"</span> . smex<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">51: </span>         <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"M-X"</span> . smex-major-mode-commands<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org71b00c3" class="outline-4">
<h4 id="org71b00c3"><span class="section-number-4">4.4.3</span> <a href="https://github.com/victorhge/iedit">iedit</a></h4>
<div class="outline-text-4" id="text-4-4-3">
<p>
Parecido com <a href="https://github.com/magnars/multiple-cursors.el">multiple-cursors</a>, permite a edição simultânea de multiplas regiões. Pessoalmente, acho interessante o fato de <code>C-'</code> esconder o resto do texto para uma vizualização geral das ocorrências, editar apenas as ocorrências de uma função ou linha.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">52: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">iedit</span>
<span class="linenr">53: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">54: </span>  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"C-;"</span> . iedit-mode<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">55: </span>         <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"C-RET"</span> . iedit-rectangle-mode<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="tip">
<ul class="org-ul">
<li><code>C-;</code> com o cursor em uma palavra para selecionar todas do texto. Pressione novamente para sair</li>
<li><code>C-'</code> esconde o texto deixando apenas uma linha antes e depois para visualização mais global</li>
<li><code>M-{</code> expande uma linha para cima</li>
<li><code>M-}</code> expande uma linha para baixo</li>
<li><code>M-;</code> altera a seleção</li>
<li><code>M-I</code> apenas a linha corrente</li>
<li><code>M-SPC</code> troca as seleções por espaços</li>
<li><code>M-&lt;</code> primeira ocorrência</li>
<li><code>M-&gt;</code> última ocorrência</li>
<li><code>M-D</code> exclui todas ocorrências</li>
<li><code>M-L</code> converte para minúsculas</li>
<li><code>M-U</code> converte para maiúsculas</li>
<li><code>M-R</code> troca ocorrências por &#x2026;</li>
<li><code>M-N</code> númera de ocorrências</li>
<li>etc..</li>
</ul>

</div>
</div>
</div>

<div id="outline-container-org684db8f" class="outline-4">
<h4 id="org684db8f"><span class="section-number-4">4.4.4</span> <a href="https://github.com/magnars/multiple-cursors.el">multiple-cursors</a></h4>
<div class="outline-text-4" id="text-4-4-4">
<p>
Trabalha com multiplos cursores. Parecido com iedit anterior mas tem algumas vantagens como os cursores mais flexíveis. Na página tem mais informações. Este <a href="http://emacsrocks.com/e13.html">vídeo</a> tem um exemplo muito interessante para a utilização. Existem diversos vídeos no site cobrindo outros assuntos.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">56: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">multiple-cursors</span>
<span class="linenr">57: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">58: </span>  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"C-S-c C-S-c"</span> . mc/edit-lines<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">59: </span>         <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"C-&gt;"</span> . mc/mark-next-like-this<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">60: </span>         <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"C-&lt;"</span> . mc/mark-previous-like-this<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org65ea95b" class="outline-4">
<h4 id="org65ea95b"><span class="section-number-4">4.4.5</span> <a href="https://github.com/DarwinAwardWinner/ido-yes-or-no">ido-yes-or-no</a></h4>
<div class="outline-text-4" id="text-4-4-5">
<p>
Facilita respostas com yes/no permitindo apenas o pressionamento de y/n e enter.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">61: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">ido-yes-or-no</span>
<span class="linenr">62: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">63: </span>  <span class="org-builtin">:config</span>
<span class="linenr">64: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>ido-yes-or-no-mode t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org37db787" class="outline-4">
<h4 id="org37db787"><span class="section-number-4">4.4.6</span> <a href="https://github.com/auto-complete/auto-complete">auto-complete</a></h4>
<div class="outline-text-4" id="text-4-4-6">
<p>
Mostra um menu para auxiliar a completar o que está sendo digitado.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">65: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">auto-complete</span>
<span class="linenr">66: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">67: </span>  <span class="org-builtin">:config</span>
<span class="linenr">68: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>ac-config-default<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org75161c4" class="outline-3">
<h3 id="org75161c4"><span class="section-number-3">4.5</span> Configurações visuais</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-orge35b911" class="outline-4">
<h4 id="orge35b911"><span class="section-number-4">4.5.1</span> <a href="https://github.com/NicolasPetton/zerodark-theme">zerodark-theme</a></h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
Achei o thema interessante. Você pode ir em <a href="https://emacsthemes.com/">Emacs Themes</a> e ver outros que você pode gostar mais.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">69: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">zerodark-theme</span>
<span class="linenr">70: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">71: </span>  <span class="org-builtin">:config</span>
<span class="linenr">72: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>load-theme 'zerodark t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1f3b66" class="outline-4">
<h4 id="orgf1f3b66"><span class="section-number-4">4.5.2</span> <a href="https://github.com/larkery/ido-grid-mode.el">ido-grid-mode</a></h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Apenas para combinar mais com a apresentação do which-key. Mostra as opções em grade em vez de linha.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">73: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">ido-grid-mode</span>
<span class="linenr">74: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">75: </span>  <span class="org-builtin">:config</span>
<span class="linenr">76: </span>  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> ido-enable-flex-matching t<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">77: </span>  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> ido-everywhere t<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">78: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>ido-mode t<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">79: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>ido-grid-mode t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe8c077" class="outline-4">
<h4 id="orgfe8c077"><span class="section-number-4">4.5.3</span> <a href="https://github.com/pjones/ido-select-window">ido-select-window</a></h4>
<div class="outline-text-4" id="text-4-5-3">
<p>
Facilita a seleção da janela quando existem diversos buffers visualizados simultaneamente.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">80: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">ido-select-window</span>
<span class="linenr">81: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">82: </span>  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"C-x o"</span> . ido-select-window<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
