README.org
*** [[https://github.com/tom-tan/hlinum-mode][hlinum-mode]]

Extende a seleção da linha atual para o número da linha. Veja outras configurações para [[https://www.emacswiki.org/emacs/LineNumbers][linum]]

#+BEGIN_SRC emacs-lisp +n
  (use-package hlinum
    :ensure t
    :config
    (hlinum-activate))
#+END_SRC

*** [[https://github.com/mattfidler/linum-off][linum-off]]

Desabilita número de linhas em determnados modos.

#+BEGIN_SRC emacs-lisp +n
  (use-package linum-off
    :ensure t)
#+END_SRC

*** [[https://github.com/zk-phi/indent-guide][indent-guide]]

Mostra uma linha para indentação do código para facilitar a visualização. Outra opção é o [[https://github.com/antonj/Highlight-Indentation-for-Emacs][highlight-indentention-for-Emacs]]

#+BEGIN_SRC emacs-lisp +n
  (use-package indent-guide
    :ensure t
    :config
    (indent-guide-global-mode))
#+END_SRC
*** [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] <<rainbow-delimiters>>

Optei por utilizar apenas duas cores utilizando as cores do tema para *keyword* e *string*. 

#+BEGIN_SRC emacs-lisp +n -r 
  (use-package rainbow-delimiters
    :ensure t
    :config
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
    (require 'color)
    (defvar my-paren-dual-colors    (ref:sc-rd1)
      '((face-attribute 'font-lock-string-face :foreground)
        (face-attribute 'font-lock-keyword-face :foreground)))
    (setq rainbow-delimiters-outermost-only-face-count 0)
    (setq rainbow-delimiters-max-face-count 2)
    (set-face-foreground 'rainbow-delimiters-depth-1-face
                         (eval (elt my-paren-dual-colors 1)))
    (set-face-foreground 'rainbow-delimiters-depth-2-face
                         (eval (elt my-paren-dual-colors 0))) (ref:sc-rd2)
                         )
#+END_SRC

#+begin_tip
Você pode deixar cada fechamento de delimitar de uma cor. Substitua da linha [[(sc-rd1)]] até a linha [[(sc-rd2)]] pelo código abaixo:
#+BEGIN_SRC emacs-lisp :tangle no
  (cl-loop
   for index from 1 to rainbow-delimiters-max-face-count
   do
   (let ((face (intern (format "rainbow-delimiters-depth-%d-face" index))))
     (cl-callf color-saturate-name (face-foreground face) 30)))
#+END_SRC
#+end_tip

** Utilitários

*** [[https://github.com/iqbalansari/restart-emacs][restart-emacs]]

Permite reicializar o Emacs de dentro do Emacs.

#+BEGIN_SRC emacs-lisp +n
  (use-package restart-emacs
    :ensure t
    :config
    (setq restart-emacs-restore-frames t))
#+END_SRC

#+begin_tip 
Prefixos
=C-u= reinicia com --debug-init
=C-u C-u= reinicia com -Q
#+end_tip

*** [[https://github.com/hniksic/emacs-htmlize][htmlize]]

Permite exportar o conteúdo de um buffer para uma página .html com o mesmo tema utilizado pelo emacs bem como salientar a sintaxe dos fontes no org-mode. 

#+BEGIN_SRC emacs-lisp +n
  (use-package htmlize
    :ensure t
    :defer t)
#+END_SRC

*** [[https://github.com/jaypei/emacs-neotree][neotree]]

Permite a utilização do neotree para navegar no sistema de arquivos em vez do dired. Assinala =Ctrl-\= para mostrar/esconder neotree.

#+BEGIN_SRC emacs-lisp +n
  (use-package neotree
    :ensure t
    :bind ("C-\\" . neotree-toggle))
#+END_SRC

*** [[https://github.com/Malabarba/paradox][paradox]]

Um gerenciador de pacotes melhorado.

#+BEGIN_SRC emacs-lisp +n
  (use-package paradox
    :ensure t
    :config
    (paradox-enable))
#+END_SRC

