README.html

<div id="outline-container-org7d737e9" class="outline-4">
<h4 id="org7d737e9"><span class="section-number-4">4.5.4</span> <a href="https://github.com/tom-tan/hlinum-mode">hlinum-mode</a></h4>
<div class="outline-text-4" id="text-4-5-4">
<p>
Extende a seleção da linha atual para o número da linha. Veja outras configurações para <a href="https://www.emacswiki.org/emacs/LineNumbers">linum</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">83: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">hlinum</span>
<span class="linenr">84: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">85: </span>  <span class="org-builtin">:config</span>
<span class="linenr">86: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>hlinum-activate<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8148dc" class="outline-4">
<h4 id="orgf8148dc"><span class="section-number-4">4.5.5</span> <a href="https://github.com/mattfidler/linum-off">linum-off</a></h4>
<div class="outline-text-4" id="text-4-5-5">
<p>
Desabilita número de linhas em determnados modos.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">87: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">linum-off</span>
<span class="linenr">88: </span>  <span class="org-builtin">:ensure</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7423fc3" class="outline-4">
<h4 id="org7423fc3"><span class="section-number-4">4.5.6</span> <a href="https://github.com/zk-phi/indent-guide">indent-guide</a></h4>
<div class="outline-text-4" id="text-4-5-6">
<p>
Mostra uma linha para indentação do código para facilitar a visualização. Outra opção é o <a href="https://github.com/antonj/Highlight-Indentation-for-Emacs">highlight-indentention-for-Emacs</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">89: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">indent-guide</span>
<span class="linenr">90: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">91: </span>  <span class="org-builtin">:config</span>
<span class="linenr">92: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>indent-guide-global-mode<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1ade761" class="outline-4">
<h4 id="org1ade761"><span class="section-number-4">4.5.7</span> <a href="https://github.com/Fanael/rainbow-delimiters">rainbow-delimiters</a> <a id="orgd00e951"></a></h4>
<div class="outline-text-4" id="text-4-5-7">
<p>
Optei por utilizar apenas duas cores utilizando as cores do tema para <b>keyword</b> e <b>string</b>. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr"> 93: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">rainbow-delimiters</span>
<span class="linenr"> 94: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr"> 95: </span>  <span class="org-builtin">:config</span>
<span class="linenr"> 96: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>add-hook 'prog-mode-hook #'rainbow-delimiters-mode<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr"> 97: </span>  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">require</span> '<span class="org-constant">color</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span id="coderef-sc-rd1" class="coderef-off"><span class="linenr"> 98: </span>  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">my-paren-dual-colors</span></span>
<span class="linenr"> 99: </span>    '<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>face-attribute 'font-lock-string-face <span class="org-builtin">:foreground</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">100: </span>      <span class="org-rainbow-delimiters-depth-2">(</span>face-attribute 'font-lock-keyword-face <span class="org-builtin">:foreground</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">101: </span>  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> rainbow-delimiters-outermost-only-face-count 0<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">102: </span>  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">setq</span> rainbow-delimiters-max-face-count 2<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">103: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>set-face-foreground 'rainbow-delimiters-depth-1-face
<span class="linenr">104: </span>                       <span class="org-rainbow-delimiters-depth-1">(</span>eval <span class="org-rainbow-delimiters-depth-2">(</span>elt my-paren-dual-colors 1<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">105: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>set-face-foreground 'rainbow-delimiters-depth-2-face
<span id="coderef-sc-rd2" class="coderef-off"><span class="linenr">106: </span>                       <span class="org-rainbow-delimiters-depth-1">(</span>eval <span class="org-rainbow-delimiters-depth-2">(</span>elt my-paren-dual-colors 0<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span></span>
<span class="linenr">107: </span>                       <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="tip">
<p>
Você pode deixar cada fechamento de delimitar de uma cor. Substitua da linha <a href="#coderef-sc-rd1" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-sc-rd1');" onmouseout="CodeHighlightOff(this, 'coderef-sc-rd1');">98</a> até a linha <a href="#coderef-sc-rd2" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-sc-rd2');" onmouseout="CodeHighlightOff(this, 'coderef-sc-rd2');">106</a> pelo código abaixo:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">cl-loop</span>
 for index from 1 to rainbow-delimiters-max-face-count
 do
 <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>face <span class="org-rainbow-delimiters-depth-1">(</span>intern <span class="org-rainbow-delimiters-depth-2">(</span>format <span class="org-string">"rainbow-delimiters-depth-%d-face"</span> index<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
   <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">cl-callf</span> color-saturate-name <span class="org-rainbow-delimiters-depth-2">(</span>face-foreground face<span class="org-rainbow-delimiters-depth-2">)</span> 30<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

</div>
</div>
</div>
</div>

<div id="outline-container-org87b2edf" class="outline-3">
<h3 id="org87b2edf"><span class="section-number-3">4.6</span> Utilitários</h3>
<div class="outline-text-3" id="text-4-6">
</div><div id="outline-container-org8c115b0" class="outline-4">
<h4 id="org8c115b0"><span class="section-number-4">4.6.1</span> <a href="https://github.com/iqbalansari/restart-emacs">restart-emacs</a></h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
Permite reicializar o Emacs de dentro do Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">108: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">restart-emacs</span>
<span class="linenr">109: </span>  <span class="org-builtin">:ensure</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="tip">
<p>
Prefixos
<code>C-u</code> reinicia com &#x2013;debug-init
<code>C-u C-u</code> reinicia com -Q
</p>

</div>
</div>
</div>

<div id="outline-container-orgd1f894c" class="outline-4">
<h4 id="orgd1f894c"><span class="section-number-4">4.6.2</span> <a href="https://github.com/hniksic/emacs-htmlize">htmlize</a></h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
Permite exportar o conteúdo de um buffer para uma página .html com o mesmo tema utilizado pelo emacs bem como salientar a sintaxe dos fontes no org-mode. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">110: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">htmlize</span>
<span class="linenr">111: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">112: </span>  <span class="org-builtin">:defer</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d33a7b" class="outline-4">
<h4 id="org7d33a7b"><span class="section-number-4">4.6.3</span> <a href="https://github.com/jaypei/emacs-neotree">neotree</a></h4>
<div class="outline-text-4" id="text-4-6-3">
<p>
Permite a utilização do neotree para navegar no sistema de arquivos em vez do dired. Assinala <code>Ctrl-\</code> para mostrar/esconder neotree.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">113: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">neotree</span>
<span class="linenr">114: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">115: </span>  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"C-\\"</span> . neotree-toggle<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5078264" class="outline-4">
<h4 id="org5078264"><span class="section-number-4">4.6.4</span> <a href="https://github.com/Malabarba/paradox">paradox</a></h4>
<div class="outline-text-4" id="text-4-6-4">
<p>
Um gerenciador de pacotes melhorado.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">116: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">paradox</span>
<span class="linenr">117: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">118: </span>  <span class="org-builtin">:config</span>
<span class="linenr">119: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>paradox-enable<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
