README.org
*** [[https://github.com/magit/magit][magit]]

Interface com o Git

#+BEGIN_SRC emacs-lisp +n
  (use-package magit
    :ensure t
    :bind ("C-x g" . magit-status))
#+END_SRC

*** [[https://github.com/tumashu/el2org][el2org]] e [[https://github.com/larstvei/ox-gfm][ox-gfm]]

O =el2org= é necessário para o =org-webpage= e o =ox-gfm= é necessário para =el2org=.

#+BEGIN_SRC emacs-lisp +n
  (use-package ox-gfm
    :ensure t)
  (use-package el2org
    :ensure t)
#+END_SRC

*** [[https://github.com/tumashu/org2web][org-webpage]] <<org-webpage>>

Para gerenciamento do blog estático no github.

#+BEGIN_SRC emacs-lisp +n
  (use-package org-webpage
    :ensure t
    :defer t)
  (org2web-add-project
   '("cadafalso"
     :repository-directory "~/projetos/org2blog"
     :remote (git "https://github.com/guaracy/guaracy.github.com.git" "master")
     :site-domain "http://guaracy.github.io/"
     :site-main-title "Cadafalso"
     :site-sub-title "Apenas mais um blog"
     :default-category "blog"
     :theme (org)
     :source-browse-url ("Github" "https://github.com/guaracy/guaracy.github.com")
     :web-server-port 7654))
#+END_SRC

** Linguagens

Pacotes para auxiliar a entrada de programas/arquivos em determinada linguagem

*** [[https://github.com/guaracy/red.el][red.el]] <<Red>>

Salientar sintaxe para arquivos Red e Red/System. Utilizo a cópia local do [[https://github.com/guaracy/red.el][GitHub]]. Como [[http://www.red-lang.org/][Red]] ainda está em desenvolvimento, ainda faltam diversas coisas. Mas o básico como salientar a sintaxe e executar/exportar códigos em documentos .org estão funcionando.

#+BEGIN_SRC emacs-lisp +n
  (use-package red
    :load-path "~/github/guaracy/red.el"
    :config
    (autoload 'red-mode "red.el" "Major mode for Red development" t)
    (add-to-list 'auto-mode-alist '("\\.red$" . red-mode))
    )
#+END_SRC

*** [[https://github.com/purcell/less-css-mode][less-css-mode]]

Para edição de arquivo .less para gerar .css (como não gosto e não precisei de s[a|c]ass). Para compilar e gerar o .css basta pressionar =C-c C-c=.

#+BEGIN_SRC emacs-lisp +n
  (use-package less-css-mode
    :ensure t)
#+END_SRC

