README.html

<div id="outline-container-org94b1df9" class="outline-4">
<h4 id="org94b1df9"><span class="section-number-4">4.6.5</span> <a href="https://github.com/magit/magit">magit</a></h4>
<div class="outline-text-4" id="text-4-6-5">
<p>
Interface com o Git
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">120: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">magit</span>
<span class="linenr">121: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">122: </span>  <span class="org-builtin">:bind</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"C-x g"</span> . magit-status<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaee22c6" class="outline-4">
<h4 id="orgaee22c6"><span class="section-number-4">4.6.6</span> <a href="https://github.com/tumashu/el2org">el2org</a> e <a href="https://github.com/larstvei/ox-gfm">ox-gfm</a></h4>
<div class="outline-text-4" id="text-4-6-6">
<p>
O <code>el2org</code> é necessário para o <code>org-webpage</code> e o <code>ox-gfm</code> é necessário para <code>el2org</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">123: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">ox-gfm</span>
<span class="linenr">124: </span>  <span class="org-builtin">:ensure</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">125: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">el2org</span>
<span class="linenr">126: </span>  <span class="org-builtin">:ensure</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org36687d2" class="outline-4">
<h4 id="org36687d2"><span class="section-number-4">4.6.7</span> <a href="https://github.com/tumashu/org2web">org-webpage</a> <a id="org11745e6"></a></h4>
<div class="outline-text-4" id="text-4-6-7">
<p>
Para gerenciamento do blog estático no github.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">127: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">org-webpage</span>
<span class="linenr">128: </span>  <span class="org-builtin">:ensure</span> t
<span class="linenr">129: </span>  <span class="org-builtin">:defer</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">130: </span><span class="org-rainbow-delimiters-depth-1">(</span>org2web-add-project
<span class="linenr">131: </span> '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"cadafalso"</span>
<span class="linenr">132: </span>   <span class="org-builtin">:repository-directory</span> <span class="org-string">"~/projetos/org2blog"</span>
<span class="linenr">133: </span>   <span class="org-builtin">:remote</span> <span class="org-rainbow-delimiters-depth-1">(</span>git <span class="org-string">"https://github.com/guaracy/guaracy.github.com.git"</span> <span class="org-string">"master"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">134: </span>   <span class="org-builtin">:site-domain</span> <span class="org-string">"http://guaracy.github.io/"</span>
<span class="linenr">135: </span>   <span class="org-builtin">:site-main-title</span> <span class="org-string">"Cadafalso"</span>
<span class="linenr">136: </span>   <span class="org-builtin">:site-sub-title</span> <span class="org-string">"Apenas mais um blog"</span>
<span class="linenr">137: </span>   <span class="org-builtin">:default-category</span> <span class="org-string">"blog"</span>
<span class="linenr">138: </span>   <span class="org-builtin">:theme</span> <span class="org-rainbow-delimiters-depth-1">(</span>org<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">139: </span>   <span class="org-builtin">:source-browse-url</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Github"</span> <span class="org-string">"https://github.com/guaracy/guaracy.github.com"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">140: </span>   <span class="org-builtin">:web-server-port</span> 7654<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org240ce35" class="outline-3">
<h3 id="org240ce35"><span class="section-number-3">4.7</span> Linguagens</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Pacotes para auxiliar a entrada de programas/arquivos em determinada linguagem
</p>
</div>

<div id="outline-container-org011991c" class="outline-4">
<h4 id="org011991c"><span class="section-number-4">4.7.1</span> <a href="https://github.com/guaracy/red.el">red.el</a> <a id="orgc19b251"></a></h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
Salientar sintaxe para arquivos Red e Red/System. Utilizo a cópia local do <a href="https://github.com/guaracy/red.el">GitHub</a>. Como <a href="http://www.red-lang.org/">Red</a> ainda está em desenvolvimento, ainda faltam diversas coisas. Mas o básico como salientar a sintaxe e executar/exportar códigos em documentos .org estão funcionando.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">141: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">red</span>
<span class="linenr">142: </span>  <span class="org-builtin">:load-path</span> <span class="org-string">"~/github/guaracy/red.el"</span>
<span class="linenr">143: </span>  <span class="org-builtin">:config</span>
<span class="linenr">144: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>autoload 'red-mode <span class="org-string">"red.el"</span> <span class="org-doc">"Major mode for Red development"</span> t<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">145: </span>  <span class="org-rainbow-delimiters-depth-2">(</span>add-to-list 'auto-mode-alist '<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"\\.red$"</span> . red-mode<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">146: </span>  <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge870212" class="outline-4">
<h4 id="orge870212"><span class="section-number-4">4.7.2</span> <a href="https://github.com/purcell/less-css-mode">less-css-mode</a></h4>
<div class="outline-text-4" id="text-4-7-2">
<p>
Para edição de arquivo .less para gerar .css (como não gosto e não precisei de s[a|c]ass). Para compilar e gerar o .css basta pressionar <code>C-c C-c</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">147: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">less-css-mode</span>
<span class="linenr">148: </span>  <span class="org-builtin">:ensure</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
