README.org
** Configurações adicionais

Algumas configurações deixadas para o final

#+BEGIN_SRC emacs-lisp +n
  (setq org-confirm-babel-evaluate nil)
  (setq org-support-shift-select t)
  (setq org-support-shift-select 'always)
  (setq org-html-htmlize-output-type 'css)
  (setq org-src-fontify-natively t)
  (setq org-export-default-language "pt_BR")
  (add-hook 'org-mode-hook #'visual-line-mode)
  (add-hook 'org-mode-hook #'toggle-word-wrap)
  (add-to-list 'org-structure-template-alist '("t" "#+begin_tip ?\n\n#+end_tip"))
  (add-to-list 'org-structure-template-alist '("n" "#+begin_note ?\n\n#+end_note"))
  ;; linguagens utilizadas por org-babel
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (red . t)
     (python . t)
     (ruby . t)
     (R . t)
     (C . t)
     (ditaa . t)
     (shell . t)))
#+END_SRC

#+BEGIN_SRC emacs-lisp +n
  (defvar my-term-shell "/usr/bin/zsh")
  (defadvice ansi-term (before force-bash)
    (interactive (list my-term-shell)))
  (ad-activate 'ansi-term)
#+END_SRC

** Definição de funções

Agora a definição de algumas funções que achei úteis (YMMV)

*** Abrir lista de arquivos recente (C-x C-r))

#+BEGIN_SRC emacs-lisp +n
  (require 'recentf)
  (recentf-mode t)
  (setq recentf-max-menu-items 25)
  (defun recentf-ido-find-file ()
    "Find a recent file using Ido."
    (interactive)
    (let ((file (ido-completing-read "Choose recent file: " recentf-list nil t)))
      (when file
        (find-file file))))
  (global-set-key (kbd "C-x C-r") 'recentf-ido-find-file)
#+END_SRC

#+BEGIN_SRC emacs-lisp +n -r
  ;; ------  fim do arquivo de configuração (ref:sc-fim)
#+END_SRC

Pronto. E essas são as [[(sc-fim)]] linhas de configuração.

* Adaptações <<adaptacao>>

Como disse antes, serão necessárias algumas alterações. Se você não deseja algum pacote, você pode apenas excluir toda a parte existente no arquivo .org. Se você não quer no momento ou não sabe se será preciso, inclua =:disabled= antes de =:ensure t= como no [[dummy-pkg][exemplo]].

Leia a [[file:REDAME.html][documentação]] para ver o resumo de cada pacote e/ou seguir o link do pacote para maiores informações. 

** Requisitos
- Ter o Emacs (versão 24.4 ou maior) instalado (instale pelo gerenciador de pacotes da sua distribuição).
- Não possuir o arquivo "~/.emacs" (se existir, faça backup e apague o existente pois será *destruído*).

** Iniciando
- Digite =git clone https://github.com/guaracy/.emacs.d ~/.emacs.d= e pressione enter para baixar este repositório.
- Digite no prompt =emacs ~/.emacs.d/README.org= para editar o arquivo README.org e siga os passos abaixo.

** Alterando
- Faça as alterações desejadas, incluindo, eliminando ou desabilitando os pacotes desejados.
- Ajuste os parâmetros dos pacotes para as suas necessidades/configurações.

** Gerando
- Salve o arquivo alterado digitando =C-x C-s=
- Gere a documentação digitando =C-c e h h=
- Gere o arquivo ~/.emacs digitando =C-c C-v t=
- Encerre o Emacs digitando =C-x C-c=

Agora é só iniciar o Emacs que os pacotes necessários serão baixados e as novas configurações serão aplicadas.

