README.html

<div id="outline-container-orgab961dd" class="outline-3">
<h3 id="orgab961dd"><span class="section-number-3">4.8</span> Configurações adicionais</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Algumas configurações deixadas para o final
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">149: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-confirm-babel-evaluate nil<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">150: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-support-shift-select t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">151: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-support-shift-select 'always<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">152: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-html-htmlize-output-type 'css<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">153: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-src-fontify-natively t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">154: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> org-export-default-language <span class="org-string">"pt_BR"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">155: </span><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'org-mode-hook #'visual-line-mode<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">156: </span><span class="org-rainbow-delimiters-depth-1">(</span>add-hook 'org-mode-hook #'toggle-word-wrap<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">157: </span><span class="org-rainbow-delimiters-depth-1">(</span>add-to-list 'org-structure-template-alist '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"t"</span> <span class="org-string">"#+begin_tip ?\n\n#+end_tip"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">158: </span><span class="org-rainbow-delimiters-depth-1">(</span>add-to-list 'org-structure-template-alist '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"n"</span> <span class="org-string">"#+begin_note ?\n\n#+end_note"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">159: </span><span class="org-comment-delimiter">;; </span><span class="org-comment">linguagens utilizadas por org-babel</span>
<span class="linenr">160: </span><span class="org-rainbow-delimiters-depth-1">(</span>org-babel-do-load-languages
<span class="linenr">161: </span> 'org-babel-load-languages
<span class="linenr">162: </span> '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-1">(</span>emacs-lisp . t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">163: </span>   <span class="org-rainbow-delimiters-depth-1">(</span>red . t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">164: </span>   <span class="org-rainbow-delimiters-depth-1">(</span>python . t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">165: </span>   <span class="org-rainbow-delimiters-depth-1">(</span>ruby . t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">166: </span>   <span class="org-rainbow-delimiters-depth-1">(</span>R . t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">167: </span>   <span class="org-rainbow-delimiters-depth-1">(</span>C . t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">168: </span>   <span class="org-rainbow-delimiters-depth-1">(</span>ditaa . t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">169: </span>   <span class="org-rainbow-delimiters-depth-1">(</span>shell . t<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">170: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defvar</span> <span class="org-variable-name">my-term-shell</span> <span class="org-string">"/usr/bin/zsh"</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">171: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defadvice</span> <span class="org-function-name">ansi-term</span> <span class="org-rainbow-delimiters-depth-2">(</span>before force-bash<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">172: </span>  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span> <span class="org-rainbow-delimiters-depth-1">(</span>list my-term-shell<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">173: </span><span class="org-rainbow-delimiters-depth-1">(</span>ad-activate 'ansi-term<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org252ed75" class="outline-3">
<h3 id="org252ed75"><span class="section-number-3">4.9</span> Definição de funções</h3>
<div class="outline-text-3" id="text-4-9">
<p>
Agora a definição de algumas funções que achei úteis (YMMV)
</p>
</div>

<div id="outline-container-org73838cf" class="outline-4">
<h4 id="org73838cf"><span class="section-number-4">4.9.1</span> Abrir lista de arquivos recente (C-x C-r))</h4>
<div class="outline-text-4" id="text-4-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">174: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> '<span class="org-constant">recentf</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">175: </span><span class="org-rainbow-delimiters-depth-1">(</span>recentf-mode t<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">176: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">setq</span> recentf-max-menu-items 25<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">177: </span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">recentf-ido-find-file</span> <span class="org-rainbow-delimiters-depth-2">()</span>
<span class="linenr">178: </span>  <span class="org-doc">"Find a recent file using Ido."</span>
<span class="linenr">179: </span>  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">interactive</span><span class="org-rainbow-delimiters-depth-2">)</span>
<span class="linenr">180: </span>  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-rainbow-delimiters-depth-2">(</span>file <span class="org-rainbow-delimiters-depth-1">(</span>ido-completing-read <span class="org-string">"Choose recent file: "</span> recentf-list nil t<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">181: </span>    <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">when</span> file
<span class="linenr">182: </span>      <span class="org-rainbow-delimiters-depth-2">(</span>find-file file<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="linenr">183: </span><span class="org-rainbow-delimiters-depth-1">(</span>global-set-key <span class="org-rainbow-delimiters-depth-2">(</span>kbd <span class="org-string">"C-x C-r"</span><span class="org-rainbow-delimiters-depth-2">)</span> 'recentf-ido-find-file<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span id="coderef-sc-fim" class="coderef-off"><span class="linenr">184: </span><span class="org-comment-delimiter">;; </span><span class="org-comment">------  fim do arquivo de configura&#231;&#227;o</span></span>
</pre>
</div>

<p>
Pronto. E essas são as <a href="#coderef-sc-fim" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-sc-fim');" onmouseout="CodeHighlightOff(this, 'coderef-sc-fim');">184</a> linhas de configuração.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb5e7801" class="outline-2">
<h2 id="orgb5e7801"><span class="section-number-2">5</span> Adaptações <a id="orga22f394"></a></h2>
<div class="outline-text-2" id="text-5">
<p>
Como disse antes, serão necessárias algumas alterações. Se você não deseja algum pacote, você pode apenas excluir toda a parte existente no arquivo .org. Se você não quer no momento ou não sabe se será preciso, inclua <code>:disabled</code> antes de <code>:ensure t</code> como no <a href="#org041d411">exemplo</a>.
</p>

<p>
Leia a <a href="REDAME.html">documentação</a> para ver o resumo de cada pacote e/ou seguir o link do pacote para maiores informações. 
</p>
</div>

<div id="outline-container-orgfe8da0b" class="outline-3">
<h3 id="orgfe8da0b"><span class="section-number-3">5.1</span> Requisitos</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Ter o Emacs (versão 24.4 ou maior) instalado (instale pelo gerenciador de pacotes da sua distribuição).</li>
<li>Não possuir o arquivo "~/.emacs" (se existir, faça backup e apague o existente pois será <b>destruído</b>).</li>
</ul>
</div>
</div>

<div id="outline-container-org4fc4155" class="outline-3">
<h3 id="org4fc4155"><span class="section-number-3">5.2</span> Iniciando</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Digite <code>git clone https://github.com/guaracy/.emacs.d ~/.emacs.d</code> e pressione enter para baixar este repositório.</li>
<li>Digite no prompt <code>emacs ~/.emacs.d/README.org</code> para editar o arquivo README.org e siga os passos abaixo.</li>
</ul>
</div>
</div>

<div id="outline-container-org9456280" class="outline-3">
<h3 id="org9456280"><span class="section-number-3">5.3</span> Alterando</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>Faça as alterações desejadas, incluindo, eliminando ou desabilitando os pacotes desejados.</li>
<li>Ajuste os parâmetros dos pacotes para as suas necessidades/configurações.</li>
</ul>
</div>
</div>

<div id="outline-container-org8d2599c" class="outline-3">
<h3 id="org8d2599c"><span class="section-number-3">5.4</span> Gerando</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>Salve o arquivo alterado digitando <code>C-x C-s</code></li>
<li>Gere a documentação digitando <code>C-c e h h</code></li>
<li>Gere o arquivo ~/.emacs digitando <code>C-c C-v t</code></li>
<li>Encerre o Emacs digitando <code>C-x C-c</code></li>
</ul>

<p>
Agora é só iniciar o Emacs que os pacotes necessários serão baixados e as novas configurações serão aplicadas.
</p>
</div>
</div>
</div>
