README.org
* Problemas

Você pode tirar dúvidas consultando o Google o DuckDuckGo, por exemplo, no [[https://stackoverflow.com/questions/tagged/emacs][stackoverflow]] e [[https://www.reddit.com/r/emacs/][reddit]] entre outros.

Como qualquer programa, o Emacs pode apresentar problemas.

#+BEGIN_tip 
Se for exportar para html =C-e= =h= e aparece a mensagem /Wrong type argument: listp, .../ pode ser suficiente digitar:

=C-u= =M-x= org-reload  ou =C-c C-x !=
#+end_tip

#+BEGIN_tip 
Se aparecer o erro: /Invalid function: org-babel-header-args-safe-fn/
rodar o código abaixo
#+BEGIN_SRC emacs-lisp
  (byte-recompile-file
       (expand-file-name "ob-R.el"
                        (file-name-directory (locate-library "org")))
       t)
#+END_SRC
#+end_tip

#+begin_tip 
Você já sabe mas, para interromper um comando digite =C-g=
#+end_tip


*Fim*
