README.html

<div id="outline-container-orgea5c59e" class="outline-2">
<h2 id="orgea5c59e"><span class="section-number-2">6</span> Problemas</h2>
<div class="outline-text-2" id="text-6">
<p>
Você pode tirar dúvidas consultando o Google o DuckDuckGo, por exemplo, no <a href="https://stackoverflow.com/questions/tagged/emacs">stackoverflow</a> e <a href="https://www.reddit.com/r/emacs/">reddit</a> entre outros.
</p>

<p>
Como qualquer programa, o Emacs pode apresentar problemas.
</p>

<div class="tip">
<p>
Se for exportar para html <code>C-e</code> <code>h</code> e aparece a mensagem <i>Wrong type argument: listp, &#x2026;</i> pode ser suficiente digitar:
</p>

<p>
<code>C-u</code> <code>M-x</code> org-reload  ou <code>C-c C-x !</code>
</p>

</div>

<div class="tip">
<p>
Se aparecer o erro: <i>Invalid function: org-babel-header-args-safe-fn</i>
rodar o código abaixo
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>byte-recompile-file
     <span class="org-rainbow-delimiters-depth-2">(</span>expand-file-name <span class="org-string">"ob-R.el"</span>
                      <span class="org-rainbow-delimiters-depth-1">(</span>file-name-directory <span class="org-rainbow-delimiters-depth-2">(</span>locate-library <span class="org-string">"org"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
     t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

</div>

<div class="tip">
<p>
Você já sabe mas, para interromper um comando digite <code>C-g</code>
</p>

</div>


<p>
<b>Fim</b>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Guaracy Monteiro</p>
<p class="date">Created: 2017-08-22 ter 11:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
